# database
# craft
craft_count = 9
craft_name = ['中立', '精靈', '皇家護衛', '巫師', '龍族', '死靈法師', '吸血鬼', '主教', '復仇者']
craft_name_en = ['neutral', 'elf', 'royal', 'witch', 'dragon', 'necro', 'vampire', 'bishop', 'nemesis']

# pack
pack_count = 20
pack_name = ['基本卡', '官方卡包', '暗鍋卡包', '菜哥出品', 
    '試行卡包', '劍指八方', '輝闇雙生', '月靈遊戲', '元素衝擊',
    '幻想扳機', '無垠遊記', '亙古史詩', '秘石戰爭', '星閃舞台',
    '崩壞後紀', '再世計劃', '求道仙途', '世界之章', '燦星蒼穹',
    '虛實境界']

# rarity
rarity_count = 4
rarity_name = ['青銅', '白銀', '黃金', '傳說']

# type
type_count = 4
type_name = ['從者', '法術', '護符', '裝備']

# ability
ability_count = 70
ability_name = [ '疾馳', 
    '突進', '守護', '潛行', '必殺', '吸血', 
    '覺醒' , '復仇' ,'渴望',  '狂亂', '共鳴',
    '入場曲', '謝幕曲', '進化時', '攻擊時', '交戰時',
    '連擊', '協作', '魔力增幅', '土之秘術', '蓄積',
    '死靈術', '葬送', '亡者召還', '倒數', '爆能強化',
    '命運抉擇', '瞬念召喚', '激奏', '結晶', '融合',
    '操縱', '操縱時', '必殺技', '奧義', '解放奧義',
    '殘虐', '追擊', '聖祝', '聯合', '融合時',
    '守墓', '轉生', '終解',  '禱告', '激發',
    '開闢', '裝填', '上膛時', '扳機', '漫遊', 
    '繼承', '指名者', '迴響', '死戰', '凌虐', 
    '貪婪', '同盟', '對立', '爆擊', '探索',
    '升格', '再臨', '元魂', '轉換', '聚魂', 
    '計量','齊奏', '獨奏', '壓境'
    ]

# trait
trait_count = 29
trait_name = ['-', '指揮官', '士兵', '土之印', '馬納歷亞', '創造物', '財寶', '機械', '自然', '雷維翁',
    '東方', '西方', '軍國', '未來', '巨像', '幹員', '修女', '魯米那斯', '光', '闇', '秘石', '守護者', 
    '昴宿星團', '偽典', '緋月', '法寶', '天界', '音樂', '天使莊']